# Módulo 3: Bases de Datos

## PARTE 1

En esta actividad veremos las consultas y comandos básicos de SQL:
- Crear tablas definiendo tipos de atributos, llaves primarias y llaves foráneas.
- Insertar datos.
- Modificar datos.
- Buscar datos.

ejecutamos extension para usar base de datos SQLITE

In [ ]:
!pip install SQLAlchemy==1.4.46
!pip install PyMySQL==1.0.2
!pip install ipython-sql==0.4.1

Collecting SQLAlchemy==1.4.46
  Downloading SQLAlchemy-1.4.46-cp310-cp310-manylinux_2_5_x86_64.manylinux1_x86_64.manylinux_2_17_x86_64.manylinux2014_x86_64.whl (1.6 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 6.0 MB/s eta 0:00:00
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from SQLAlchemy==1.4.46) (2.0.2)
Installing collected packages: SQLAlchemy
  Attempting uninstall: SQLAlchemy
    Found existing installation: SQLAlchemy 2.0.19
    Uninstalling SQLAlchemy-2.0.19:
      Successfully uninstalled SQLAlchemy-2.0.19
ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
ipython-sql 0.5.0 requires sqlalchemy>=2.0, but you have sqlalchemy 1.4.46 which is incompatible.
Successfully installed SQLAlchemy-1.4.46
Collecting PyMySQL==1.0.2
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 43.8/43.8 kB 1.1 MB/s eta 0:00:00
Installing collected packages: PyMySQL
Successfully installed PyMySQL-1.0.2
Collecting ipython-sql==0.4.1
  Downloading ipython_sql-0.4.1-py3-none-any.whl (21 kB)
Collecting prettytable<1 (from ipython-sql==0.4.1)
  Downloading prettytable-0.7.2.zip (28 kB)
  Preparing metadata (setup.py) ... done
Requirement already satisfied: ipython>=1.0 in /usr/local/lib/python3.10/dist-packages (from ipython-sql==0.4.1) (7.34.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in /usr/local/lib/python3.10/dist-packages (from ipython-sql==0.4.1) (1.4.46)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (from ipython-sql==0.4.1) (0.4.4)
Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from ipython-sql==0.4.1) (1.16.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in /usr/local/lib/python3.10/dist-packages (from ipython-sql==0.4.1) (0.2.0)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython>=1.0->ipython-sql==0.4.1) (67.7.2)
Collecting jedi>=0.16 (from ipython>=1.0->ipython-sql==0.4.1)
  Downloading jedi-0.19.0-py2.py3-none-any.whl (1.6 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 21.5 MB/s eta 0:00:00
Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython>=1.0->ipython-sql==0.4.1) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython>=1.0->ipython-sql==0.4.1) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.10/dist-packages (from ipython>=1.0->ipython-sql==0.4.1) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython>=1.0->ipython-sql==0.4.1) (3.0.39)
Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython>=1.0->ipython-sql==0.4.1) (2.16.1)
Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython>=1.0->ipython-sql==0.4.1) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.10/dist-packages (from ipython>=1.0->ipython-sql==0.4.1) (0.1.6)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython>=1.0->ipython-sql==0.4.1) (4.8.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=0.6.7->ipython-sql==0.4.1) (2.0.2)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython>=1.0->ipython-sql==0.4.1) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython>=1.0->ipython-sql==0.4.1) (0.7.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql==0.4.1) (0.2.6)
Building wheels for collected packages: prettytable
  Building wheel for prettytable (setup.py) ... done
  Created wheel for prettytable: filename=prettytable-0.7.2-py3-none-any.whl size=13694 sha256=9725e6e4312579cc41114efbc862af6598eafdc8db3f71c82ac7c0d13bf748bb
  Stored in directory: /root/.cache/pip/wheels/25/4b/07/18c5d92824315576e478206ea69df34a9e31958f6143eb0e31
Successfully built prettytable
Installing collected packages: prettytable, jedi, ipython-sql
  Attempting uninstall: prettytable
    Found existing installation: prettytable 3.8.0
    Uninstalling prettytable-3.8.0:
      Successfully uninstalled prettytable-3.8.0
  Attempting uninstall: ipython-sql
    Found existing installation: ipython-sql 0.5.0
    Uninstalling ipython-sql-0.5.0:
      Successfully uninstalled ipython-sql-0.5.0
Successfully installed ipython-sql-0.4.1 jedi-0.19.0 prettytable-0.7.2

In [ ]:
# load the SQL magic extension
# https://github.com/catherinedevlin/ipython-sql
# this extension allows us to connect to DBs and issue SQL command
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

creamos base de datos de compras

In [ ]:
%%sql
sqlite:///compras.db

Modelo relacional:

- `Clientes(id INT PRIMARY KEY, nombre VARCHAR, edad INT)`
- `Tiendas(id INT PRIMARY KEY, nombre VARCHAR, direccion VARCHAR, rubro VARCHAR)`
- `Pedidos(pid INT PRIMARY KEY, id_cliente INT, id_tienda INT, fecha DATE,    monto INT , FOREIGN KEY (cid) references Clientes(id) , FOREIGN KEY (tid) REFERENCES Tiendas(id))`

Crear tablas

In [ ]:
%%sql
CREATE TABLE Clientes(cid INT PRIMARY KEY,
                      nombre VARCHAR,
                      edad INT);

CREATE TABLE Tiendas(tid INT PRIMARY KEY,
                     nombre VARCHAR,
                     direccion VARCHAR,
                     rubro VARCHAR);

CREATE TABLE Pedidos(pid INT PRIMARY KEY,
                     cid INT,
                     tid INT,
                     fecha DATE,
                     monto INT,
                     FOREIGN KEY (cid) REFERENCES Clientes(cid),
                     FOREIGN KEY (tid) REFERENCES Tiendas(tid));

 * sqlite:///compras.db
Done.
Done.
Done.

[]

Eliminar tablas

In [ ]:
%%sql
DROP TABLE Clientes;
DROP TABLE Tiendas;
DROP TABLE Pedidos;

 * sqlite:///compras.db
Done.
Done.
Done.

[]

In [ ]:
%%sql
SELECT * FROM Pedidos

 * sqlite:///compras.db
Done.

[]

Vemos que nos da error porque la tabla Pedidos no existe dado que la acabamos de eliminar.

Insertar datos en tablas

In [ ]:
%%sql

INSERT INTO Clientes VALUES(23, 'Julio', 31);
INSERT INTO Clientes VALUES(29, 'Felipe', 33);
INSERT INTO Clientes VALUES(31, 'Arturo', 55);
INSERT INTO Clientes VALUES(32, 'Pedro',  25);
INSERT INTO Clientes VALUES(58, 'Oscar',  35);
INSERT INTO Clientes VALUES(64, 'Isidora', 35);
INSERT INTO Clientes VALUES(71, 'Pedro', 18);
INSERT INTO Clientes VALUES(74, 'Isidora', 35);
INSERT INTO Clientes VALUES(85, 'Rosa', 18);
INSERT INTO Clientes VALUES(95, 'Roman', 63);

INSERT INTO Tiendas VALUES(101, 'Pasteles Las Fatima', 'Grecia 2490' , 'Pasteleria');
INSERT INTO Tiendas VALUES(102, 'Lider', 'Av Brasil 2213' , 'Supermercado');
INSERT INTO Tiendas VALUES(103, 'Jumbo', 'Santo Domingo 1928' , 'Supermercado');
INSERT INTO Tiendas VALUES(104, 'Apple', 'Camino el Alba 1023' , 'Tecnologia');
INSERT INTO Tiendas VALUES(105, 'Apple', 'Las Tortolas 2839' , 'Tecnologia');
INSERT INTO Tiendas VALUES(106, 'Pasteles Sur', 'Apoquindo 2233' , 'Pasteleria');


INSERT INTO Pedidos VALUES(1, 23, 101, '2016-10-10', 25000);
INSERT INTO Pedidos VALUES(2,23, 102, '2016-10-12', 20000);
INSERT INTO Pedidos VALUES(3,23, 103, '2016-08-10', 3500);
INSERT INTO Pedidos VALUES(4,23, 104, '2017-11-11', 9000);
INSERT INTO Pedidos VALUES(5,31, 102, '2017-11-18', 1200);
INSERT INTO Pedidos VALUES(6,31, 103, '2018-11-26', 23000);
INSERT INTO Pedidos VALUES(7,31, 104, '2018-12-11', 9500);
INSERT INTO Pedidos VALUES(8,64, 101, '2018-12-21', 9000);
INSERT INTO Pedidos VALUES(9,64, 102, '2019-09-20', 2900);
INSERT INTO Pedidos VALUES(10,74, 103, '2019-09-22', 1200);

 * sqlite:///compras.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

Proyectamos los resultados

In [ ]:
%%sql
SELECT * FROM Clientes

 * sqlite:///compras.db
Done.

[(23, 'Julio', 31),
 (29, 'Felipe', 33),
 (31, 'Arturo', 55),
 (32, 'Pedro', 25),
 (58, 'Oscar', 35),
 (64, 'Isidora', 35),
 (71, 'Pedro', 18),
 (74, 'Isidora', 35),
 (85, 'Rosa', 18),
 (95, 'Roman', 63)]

In [ ]:
%%sql
SELECT * FROM Tiendas

 * sqlite:///compras.db
Done.

[(101, 'Pasteles Las Fatima', 'Grecia 2490', 'Pasteleria'),
 (102, 'Lider', 'Av Brasil 2213', 'Supermercado'),
 (103, 'Jumbo', 'Santo Domingo 1928', 'Supermercado'),
 (104, 'Apple', 'Camino el Alba 1023', 'Tecnologia'),
 (105, 'Apple', 'Las Tortolas 2839', 'Tecnologia'),
 (106, 'Pasteles Sur', 'Apoquindo 2233', 'Pasteleria')]

In [ ]:
%%sql
SELECT * FROM Pedidos

 * sqlite:///compras.db
Done.

[(1, 23, 101, '2016-10-10', 25000),
 (2, 23, 102, '2016-10-12', 20000),
 (3, 23, 103, '2016-08-10', 3500),
 (4, 23, 104, '2017-11-11', 9000),
 (5, 31, 102, '2017-11-18', 1200),
 (6, 31, 103, '2018-11-26', 23000),
 (7, 31, 104, '2018-12-11', 9500),
 (8, 64, 101, '2018-12-21', 9000),
 (9, 64, 102, '2019-09-20', 2900),
 (10, 74, 103, '2019-09-22', 1200)]

Modificar datos de tablas

In [ ]:
%%sql
UPDATE Clientes SET edad = 32 WHERE nombre = 'Julio'

 * sqlite:///compras.db
1 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM Clientes WHERE nombre = 'Julio'

 * sqlite:///compras.db
Done.

[(23, 'Julio', 32)]

Consultar datos

1. Nombre y edad de clientes mayores de 18 y menores de 40 años

In [ ]:
%%sql
SELECT nombre, edad FROM Clientes WHERE edad > 18 AND edad < 40

 * sqlite:///compras.db
Done.

[('Julio', 32),
 ('Felipe', 33),
 ('Pedro', 25),
 ('Oscar', 35),
 ('Isidora', 35),
 ('Isidora', 35)]

2. Nombre y direccion de tiendas que venden productos de tecnología

In [ ]:
%%sql
SELECT nombre, direccion FROM Tiendas WHERE rubro = 'Tecnologia'

 * sqlite:///compras.db
Done.

[('Apple', 'Camino el Alba 1023'), ('Apple', 'Las Tortolas 2839')]

3. Toda la información de pedidos cuyo monto gastado sea mayor a $10,000 CLP

In [ ]:
%%sql
SELECT * FROM Pedidos WHERE monto > 10000

 * sqlite:///compras.db
Done.

[(1, 23, 101, '2016-10-10', 25000),
 (2, 23, 102, '2016-10-12', 20000),
 (6, 31, 103, '2018-11-26', 23000)]

## PARTE 2:
- Reunion de tablas
- Consultas agregadas

**Reunion** Nombres de clientes que han hecho alguna vez un pedido.

In [ ]:
%%sql
SELECT DISTINCT Clientes.nombre
FROM Clientes, Pedidos
WHERE Clientes.cid = Pedidos.cid

 * sqlite:///compras.db
Done.

[('Julio',), ('Arturo',), ('Isidora',)]

**Auxiliar: STRFTIME** Monto promedio en pedidos por año

In [ ]:
%%sql
SELECT pid, cid, fecha, strftime('%Y',fecha) as "año", monto
FROM Pedidos
WHERE año = '2016'

 * sqlite:///compras.db
Done.

[(1, 23, '2016-10-10', '2016', 25000),
 (2, 23, '2016-10-12', '2016', 20000),
 (3, 23, '2016-08-10', '2016', 3500)]

**Agregacion** Monto total vendido por año

In [ ]:
%%sql
SELECT strftime('%Y',fecha) as "año", AVG(monto)
FROM Pedidos
GROUP BY año

 * sqlite:///compras.db
Done.

[('2016', 16166.666666666666),
 ('2017', 5100.0),
 ('2018', 13833.333333333334),
 ('2019', 2050.0)]

**Agregación** Año y total de ventas anuales que superen en total los $13.0000

In [ ]:
%%sql
SELECT strftime('%Y',fecha) as "año", AVG(monto)
FROM Pedidos
GROUP BY año
HAVING AVG(monto) > 13000

 * sqlite:///compras.db
Done.

[('2016', 16166.666666666666), ('2018', 13833.333333333334)]

**Auxiliar LIKE:** Clientes cuya inicial sea "J"

In [ ]:
%%sql
SELECT nombre
FROM Clientes
WHERE nombre LIKE 'J%'

 * sqlite:///compras.db
Done.

[('Julio',)]

## PARTE 3:
Python y uso de cursores usando el mismo modelo relacional de antes

In [1]:
import sqlite3

In [2]:
con = sqlite3.connect(":memory:")

In [6]:
cur = con.cursor()

In [4]:
cur.execute("CREATE TABLE Clientes(cid INT PRIMARY KEY, nombre VARCHAR, edad INT);")
cur.execute("CREATE TABLE Tiendas(tid INT PRIMARY KEY, nombre VARCHAR, direccion VARCHAR, rubro VARCHAR);")
cur.execute("CREATE TABLE Pedidos(pid INT PRIMARY KEY, cid INT, tid INT, fecha DATE, monto INT, FOREIGN KEY (cid) REFERENCES Clientes(cid), FOREIGN KEY (tid) REFERENCES Tiendas(tid));")

cur.execute("INSERT INTO Clientes VALUES(23, 'Julio', 31);")
cur.execute("INSERT INTO Clientes VALUES(29, 'Felipe', 33);")
cur.execute("INSERT INTO Clientes VALUES(31, 'Arturo', 55);")
cur.execute("INSERT INTO Clientes VALUES(32, 'Pedro',  25);")
cur.execute("INSERT INTO Clientes VALUES(58, 'Oscar',  35);")
cur.execute("INSERT INTO Clientes VALUES(64, 'Isidora', 35);")
cur.execute("INSERT INTO Clientes VALUES(71, 'Pedro', 18);")
cur.execute("INSERT INTO Clientes VALUES(74, 'Isidora', 35);")
cur.execute("INSERT INTO Clientes VALUES(85, 'Rosa', 18);")
cur.execute("INSERT INTO Clientes VALUES(95, 'Roman', 63);")

cur.execute("INSERT INTO Tiendas VALUES(101, 'Pasteles Las Fatima', 'Grecia 2490' , 'Pasteleria');")
cur.execute("INSERT INTO Tiendas VALUES(102, 'Lider', 'Av Brasil 2213' , 'Supermercado');")
cur.execute("INSERT INTO Tiendas VALUES(103, 'Jumbo', 'Santo Domingo 1928' , 'Supermercado');")
cur.execute("INSERT INTO Tiendas VALUES(104, 'Apple', 'Camino el Alba 1023' , 'Tecnologia');")
cur.execute("INSERT INTO Tiendas VALUES(105, 'Apple', 'Las Tortolas 2839' , 'Tecnologia');")
cur.execute("INSERT INTO Tiendas VALUES(106, 'Pasteles Sur', 'Apoquindo 2233' , 'Pasteleria');")

cur.execute("INSERT INTO Pedidos VALUES(1, 23, 101, '2016-10-10', 25000);")
cur.execute("INSERT INTO Pedidos VALUES(2,23, 102, '2016-10-12', 20000);")
cur.execute("INSERT INTO Pedidos VALUES(3,23, 103, '2016-08-10', 3500);")
cur.execute("INSERT INTO Pedidos VALUES(4,23, 104, '2017-11-11', 9000);")
cur.execute("INSERT INTO Pedidos VALUES(5,31, 102, '2017-11-18', 1200);")
cur.execute("INSERT INTO Pedidos VALUES(6,31, 103, '2018-11-26', 23000);")
cur.execute("INSERT INTO Pedidos VALUES(7,31, 104, '2018-12-11', 9500);")
cur.execute("INSERT INTO Pedidos VALUES(8,64, 101, '2018-12-21', 9000);")
cur.execute("INSERT INTO Pedidos VALUES(9,64, 102, '2019-09-20', 2900);")
cur.execute("INSERT INTO Pedidos VALUES(10,74, 103, '2019-09-22', 1200);")



cur.commit()

AttributeError: 'sqlite3.Cursor' object has no attribute 'commit'

In [ ]:
query = cur.execute("SELECT * FROM Clientes")

for x in query:
  print(x)

(23, 'Julio', 31)
(29, 'Felipe', 33)
(31, 'Arturo', 55)
(32, 'Pedro', 25)
(58, 'Oscar', 35)
(64, 'Isidora', 35)
(71, 'Pedro', 18)
(74, 'Isidora', 35)
(85, 'Rosa', 18)
(95, 'Roman', 63)

Insertar datos desde un diccionario de Python a la base de datos:

In [ ]:
dict_tiendas = {'11200': {'nombre': 'Pasteles' , 'direccion': 'Calle 13', 'rubro': 'Pasteleria'},
            '20220': {'nombre': 'Computadores', 'direccion': 'Calle 12' , 'rubro': 'Tecnologia'},
            '30220': {'nombre': 'Albi', 'direccion': 'Calle 22' , 'rubro': 'Alimentacion'}
            }


for id_ in dict_tiendas:

  nombre =  dict_tiendas[id_]['nombre']
  direccion = dict_tiendas[id_]['direccion']
  rubro = dict_tiendas[id_]['rubro']

  cur.execute(f"INSERT INTO Tiendas VALUES(?, ?,?,?);", (id_, nombre, direccion, rubro))

In [ ]:
q = cur.execute("SELECT * FROM TIENDAS")

for x in q:
  print(x)

(101, 'Pasteles Las Fatima', 'Grecia 2490', 'Pasteleria')
(102, 'Lider', 'Av Brasil 2213', 'Supermercado')
(103, 'Jumbo', 'Santo Domingo 1928', 'Supermercado')
(104, 'Apple', 'Camino el Alba 1023', 'Tecnologia')
(105, 'Apple', 'Las Tortolas 2839', 'Tecnologia')
(106, 'Pasteles Sur', 'Apoquindo 2233', 'Pasteleria')
(11200, 'Pasteles', 'Calle 13', 'Pasteleria')
(20220, 'Computadores', 'Calle 12', 'Tecnologia')
(30220, 'Albi', 'Calle 22', 'Alimentacion')

Ejemplo práctico: Input del usuario

In [ ]:
id_ = 1120
nombre = input('ingresa tu nombre: ')
edad = input('ingresa tu edad: ')

cur.execute("INSERT INTO Clientes VALUES (?, ?, ?)", (id_, nombre, edad))

ingresa tu nombre: Miguel
ingresa tu edad: 23

In [ ]:
q = cur.execute("SELECT * FROM Clientes")

for x in q:
  print(x)

(23, 'Julio', 31)
(29, 'Felipe', 33)
(31, 'Arturo', 55)
(32, 'Pedro', 25)
(58, 'Oscar', 35)
(64, 'Isidora', 35)
(71, 'Pedro', 18)
(74, 'Isidora', 35)
(85, 'Rosa', 18)
(95, 'Roman', 63)
(1120, 'Miguel', 23)